app/fixtures/adr_response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <BG:synchroonAntwoordBericht xmlns:BG="http://www.egem.nl/StUF/sector/bg/0204" xmlns:StUF="http://www.egem.nl/StUF/StUF0204" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <StUF:stuurgegevens xmlns="http://www.egem.nl/StUF/StUF0204">
                <StUF:berichtsoort>La01</StUF:berichtsoort>
                <StUF:entiteittype>ADR</StUF:entiteittype>
                <StUF:sectormodel>BG</StUF:sectormodel>
                <StUF:versieStUF>0204</StUF:versieStUF>
                <StUF:versieSectormodel>0204</StUF:versieSectormodel>
                <StUF:zender>
                    <StUF:organisatie>Amsterdam</StUF:organisatie>
                    <StUF:applicatie>applicatie</StUF:applicatie>
                </StUF:zender>
                <StUF:ontvanger>
                    <StUF:applicatie>applicatie</StUF:applicatie>
                    <StUF:gebruiker>gebruiker</StUF:gebruiker>
                </StUF:ontvanger>
                <StUF:referentienummer>MK18D0</StUF:referentienummer>
                <StUF:tijdstipBericht>2020061711102835</StUF:tijdstipBericht>
                <StUF:antwoord>
                    <StUF:crossRefNummer>MijnAmsterdam</StUF:crossRefNummer>
                </StUF:antwoord>
            </StUF:stuurgegevens>
            <BG:body xmlns="http://www.egem.nl/StUF/sector/bg/0204">
                <BG:ADR soortEntiteit="F" StUF:sleutelVerzendend="10042" StUF:sleutelGegevensbeheer="10042">
                    <BG:postcode>1011PN</BG:postcode>
                    <BG:woonplaatsnaam>Amsterdam</BG:woonplaatsnaam>
                    <BG:tijdvakGeldigheid>
                        <StUF:begindatumTijdvakGeldigheid xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:einddatumTijdvakGeldigheid xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    </BG:tijdvakGeldigheid>
                    <BG:ADRPRSVBL soortEntiteit="R" StUF:sleutelVerzendend="100423" StUF:sleutelGegevensbeheer="100423">
                        <BG:tijdvakRelatie>
                            <StUF:begindatumRelatie>20130101</StUF:begindatumRelatie>
                            <StUF:einddatumRelatie xsi:nil="true" StUF:noValue="geenWaarde"/>
                        </BG:tijdvakRelatie>
                        <BG:extraElementen>
                            <StUF:extraElement naam="aanduidingGegevensInOnderzoek" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        </BG:extraElementen>
                        <BG:PRS soortEntiteit="F" StUF:sleutelVerzendend="100" StUF:sleutelGegevensbeheer="100">
                            <BG:datumOverlijden xsi:nil="true" StUF:noValue="geenWaarde"/>
                            <BG:tijdvakGeldigheid>
                                <StUF:begindatumTijdvakGeldigheid xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                                <StUF:einddatumTijdvakGeldigheid xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                            </BG:tijdvakGeldigheid>
                        </BG:PRS>
                    </BG:ADRPRSVBL>
                    <BG:ADRPRSVBL soortEntiteit="R" StUF:sleutelVerzendend="1004231" StUF:sleutelGegevensbeheer="1004231">
                        <BG:tijdvakRelatie>
                            <StUF:begindatumRelatie>20090101</StUF:begindatumRelatie>
                            <StUF:einddatumRelatie xsi:nil="true" StUF:noValue="geenWaarde"/>
                        </BG:tijdvakRelatie>
                        <BG:extraElementen>
                            <StUF:extraElement naam="aanduidingGegevensInOnderzoek" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        </BG:extraElementen>
                        <BG:PRS soortEntiteit="F" StUF:sleutelVerzendend="1004231" StUF:sleutelGegevensbeheer="1004231">
                            <BG:datumOverlijden xsi:nil="true" StUF:noValue="geenWaarde"/>
                            <BG:tijdvakGeldigheid>
                                <StUF:begindatumTijdvakGeldigheid xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                                <StUF:einddatumTijdvakGeldigheid xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                            </BG:tijdvakGeldigheid>
                        </BG:PRS>
                    </BG:ADRPRSVBL>
                    <BG:ADRPRSVBL soortEntiteit="R" StUF:sleutelVerzendend="10042310" StUF:sleutelGegevensbeheer="10042310">
                        <BG:tijdvakRelatie>
                            <StUF:begindatumRelatie>20090101</StUF:begindatumRelatie>
                            <StUF:einddatumRelatie xsi:nil="true" StUF:noValue="geenWaarde"/>
                        </BG:tijdvakRelatie>
                        <BG:extraElementen>
                            <StUF:extraElement naam="aanduidingGegevensInOnderzoek" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        </BG:extraElementen>
                        <BG:PRS soortEntiteit="F" StUF:sleutelVerzendend="10042310" StUF:sleutelGegevensbeheer="10042310">
                            <BG:datumOverlijden xsi:nil="true" StUF:noValue="geenWaarde"/>
                            <BG:tijdvakGeldigheid>
                                <StUF:begindatumTijdvakGeldigheid xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                                <StUF:einddatumTijdvakGeldigheid xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                            </BG:tijdvakGeldigheid>
                        </BG:PRS>
                    </BG:ADRPRSVBL>
                </BG:ADR>
            </BG:body>
        </BG:synchroonAntwoordBericht>
    </soapenv:Body>
</soapenv:Envelope>
